import { Dialog, DialogContent } from "@/components/ui/dialog"
import { Dispatch, SetStateAction } from "react"


type Props = {
    open: boolean
    setOpen: Dispatch<SetStateAction<boolean>>
}


export default function PrivacyDilaog({ open, setOpen }: Props) {

    const BoldText = ({ text }: { text: string }) => {
        return (
            <p className="text-[100%] font-bold">
                {text}
            </p>
        )
    }

    const BalanceText = ({ text }: { text: string }) => {
        return (
            <p className="text-[90%]">
                {text}
            </p>
        )
    }

    return (
        <Dialog open={open}>
            <DialogContent className="flex gap-[8px] flex-col items-start min-w-[900px] justify-center bg-white focus-visible:outline-0 focus-visible:ring-offset-0 focus-visible:ring-0" onInteractOutside={() => setOpen(false)}>
                <p className="text-[180%] font-bold text-nowrap" >Политика конфиденциальности</p>

                <BalanceText text="Оставляя данные на сайте, Вы соглашаетесь с Политикой конфиденциальности и защиты информации." />

                <BoldText text="Защита данных" />

                <p className="text-[90%]">
                    Администрация сайта
                    <a className="text-slate-500" href="https://micauto.vercel.app">
                        &nbsp;micauto.vercel.app&nbsp;
                    </a>
                    (далее Сайт) не может передать или раскрыть информацию, предоставленную пользователем (далее Пользователь) при регистрации
                    и использовании функций сайта третьим лицам, кроме случаев, описанных законодательством страны, на территории которой пользователь ведет свою деятельность.
                </p>

                <BoldText text="Получение персональной информации" />

                <BalanceText text={`Для коммуникации на сайте пользователь обязан внести некоторую персональную информацию. 
                Для проверки предоставленных данных, сайт оставляет за собой право потребовать доказательства идентичности в онлайн или офлайн режимах.`} />

                <BoldText text="Использование персональной информации" />

                <BalanceText text={`Сайт использует личную информацию Пользователя для обслуживания и для улучшения качества предоставляемых услуг.
                Часть персональной информации может быть предоставлена банку или платежной системе, в случае, если предоставление этой информации 
                обусловлено процедурой перевода средств платежной системе, услугами которой Пользователь желает воспользоваться. Сайт прилагает все 
                усилия для сбережения в сохранности личных данных Пользователя. Личная информация может быть раскрыта в случаях, описанных законодательством,
                 либо когда администрация сочтет подобные действия необходимыми для соблюдения юридической процедуры, судебного распоряжения или легального
                 процесса необходимого для работы Пользователя с Сайтом. В других случаях, ни при каких условиях, информация, которую Пользователь передает Сайту, 
                 не будет раскрыта третьим лицам.`} />

                <BoldText text="Коммуникация" />

                <BalanceText text={`После того, как Пользователь оставил данные, он получает сообщение, подтверждающее его успешную регистрацию. 
                Пользователь имеет право в любой момент прекратить получение информационных бюллетеней воспользовавшись соответствующим сервисом в Сайте.`} />

            </DialogContent>
        </Dialog >
    )
}